Repository: mheidinger/PReek
Catalog: Localizable.xcstrings
Source language: en
Languages: de

source: %lld weeks
de: %lld Wochen

source: < Image >
de: < Bild >

source: Add Username
de: Nutzername hinzufügen

source: Additional Settings
de: Weitere Einstellungen

source: approved
de: hat genehmigt

source: Are you sure?
de: Bist du sicher?

source: by %@
de: von %@

source: by Max Heidinger
de: von Max Heidinger

source: Click the icon again to confirm the action.
de: Klicke erneut auf das Icon, um die Aktion zu bestätigen.

source: Close window when opening a link, press CMD on click to get opposite behaviour
de: Fenster nach Öffnen eines Links schließen, drücke CMD während des Klicken für ein umgekehrtes Verhalten.

source: closed
de: hat geschlossen

source: Closed
de: Geschlossen

source: commented
de: hat kommentiert

source: commented on %@:
de: hat kommentiert in %@:

# connection-settings.enterprise-url.explanation
source: Provide the base URL without any suffix. For example: `https://github.acme.org`
de: Gebe die URL ohne Suffix an. Beispiel: `https://github.acme.org`

# connection-settings.pat.explanation
source: The Personal Access Token (PAT) should be of type 'classic' and requires the 'notifications' scope. For access to private repositories, additionally the 'repo' scope is required. Notifications are used to get the Pull Requests that are shown yo you. See the [GitHub documentation](https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/managing-your-personal-access-tokens#creating-a-personal-access-token-classic) on how to generate a PAT.
de: Der Personal Access Token (PAT) sollte vom Typ 'Classic' sein und benötigt die 'notifications' Berechtigung. Für Zugang zu privaten repositories ist zusätzlich die 'repo' Berechtigung notwendig. Benachrichtigungen werden verwendet, um die für dich relevanten Pull Requests zu identifizieren. Informationen zum Generieren eines PAT findest du in der [GitHub Dokumentation](https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/managing-your-personal-access-tokens#creating-a-personal-access-token-classic).

source: Continue
de: Weiter

source: converted to draft
de: hat in einen Entwurf umgewandelt

source: Could not parse GitHub Enterprise URL
de: GitHub Enterprise URL ist keine valide URL

source: Create Issue
de: Issue erstellen

source: disabled auto-merge
de: hat auto-merge deaktiviert

source: Don't show PRs that only have been contributed to by these users
de: PRs nicht anzeigen, zu denen nur von folgenden Nutzern beigetragen wurde

source: Draft
de: Entwurf

source: enabled auto-merge (%@)
de: hat auto-merge aktiviert (%@)

source: Enter PAT
de: PAT eingeben

source: Error: %@
de: Fehler: %@

source: Excluded Users
de: Ignorierte Nutzer

source: Failed to fetch notifications
de: Abrufen der Benachrichtigungen fehlgeschlagen

source: Failed to generate QR code
de: QR Code Generierung fehlgeschlagen

source: Failed to import shared configuration
de: Importieren der geteilten Konfiguration fehlgeschlagen

source: Failed to send request to GitHub
de: Senden der Anfrage zu GitHub fehlgeschlagen

source: Fetch PRs from notifications of last
de: PRs laden von Benachrichtigungen der letzten

source: Filters
de: Filter

source: force pushed
de: hat force gepusht

source: From:
de: Von:

source: GitHub Connection
de: GitHub Verbindung

source: Import an existing configuration for another device running PReek.
de: Importieren eine existierende Konfiguration von einem anderen Gerät auf dem PReek läuft.

source: Import Configuration
de: Konfiguration importieren

source: Last updated at %@
de: Zuletzt aktualisiert um %@

source: Load More
de: Mehr Laden

source: Loading Pull Requests...
de: Laden…

source: Made by Max Heidinger
de: Von Max Heidinger

source: Mark all as read
de: Alle als gelesen markieren

source: Mark All as Read
de: Alle als gelesen markieren

source: Mark read
de: Gelesen markieren

source: Mark unread
de: Ungelesen markieren

source: marked ready
de: hat als bereit markiert

source: merged
de: hat gemergt

source: New
de: Neu

source: No configuration to share
de: Keine Konfiguration zum Teilen

source: No Connection
de: Keine Verbindung

source: No Events
de: Keine Events

source: No token provided
de: Kein Token

source: now
de: jetzt

source: Only remove closed PRs
de: Nur geschlossene PRs entfernen

source: Open
de: Offen

source: Open PReek on another device and click on "Share" in the settings.
de: Öffne PReek auf einem anderen Gerät und klicke auf “Share” in den Einstellungen.

source: PAT is invalid
de: PAT ist ungültig

source: PAT is missing permissions, does it have the 'notifications' scope?
de: PAT fehlen Berechtigungen, ist die 'notifications' Berechtigung zugewiesen?

source: PAT is missing required scope: %@
de: PAT fehlt folgende Berechtigung: %@

source: PAT is missing required scopes
de: PAT fehlen Berechtigungen

source: pushed
de: hat gepusht

source: Quick help
de: Hilfe

source: Quit App
de: App Beenden

source: Refresh
de: Aktualisieren

source: Remove
de: Entfernen

source: Remove PRs not updated since
de: Nicht aktualisierte PRs entfernen nach

source: renamed
de: hat umbenannt

source: reopened
de: hat wieder geöffnet

source: replied on %@:
de: antwortet in %@:

source: replied:
de: antwortet:

source: requested changes
de: hat Änderungen angefordert

source: requested review
de: hat eine Review angefordert

source: Required Settings
de: Benötigte Einstellungen

source: reviewed
de: hat reviewed

source: reviewed (dismissed)
de: hat reviewed (verworfen)

source: Scan this QR code in the PReek App on another device to import your configuration.
de: Scanne diesen QR Code in the PReek App auf einem anderen Gerät, um deine Konfiguration zu importieren.

source: Select a pull request
de: Wähle eine Pull Request aus

source: Settings
de: Einstellungen

source: Share
de: Teilen

source: Share Configuration
de: Konfiguration Teilen

source: Shared Configuration includes: - Your GitHub token - If provided the GitHub Enterprise URL - PR fetch and remove config values - Excluded Users
de: Die geteilte Konfiguration enthält: - Dein GitHub Token - Falls vorhanden die GitHub Enterprise URL - Einstellungen zum Laden und Entfernen von PRs - Ignorierte Nutzer

source: Show closed
de: Geschlossene zeigen

source: Show read
de: Gelesene zeigen

source: Tap to reveal
de: Tippen zum Anzeigen

source: To:
de: Zu:

source: unknown
de: unbekannt

source: Unknown error happened
de: Ein unbekannter Fehler ist aufgetreten

source: Unknown error happened when calling the GitHub API
de: Unbekannter Fehler ist aufgetreten beim Aufruf der GitHub API

source: updated %@
de: aktualisiert %@

# updated %@ at %@
source: updated %1$@ at %2$@
de: aktualisiert %1$@ um %2$@

source: updated yesterday at %@
de: aktualisiert gestern um %@

source: Use GitHub Enterprise
de: Verwende GitHub Enterprise

source: Username
de: Benutzername

# welcome.subtitle
source: Let's get you started!
de: Los geht's!

# welcome.title
source: Welcome to PReek
de: Willkommen bei PReek!

source: You are done for today! 🎉
de: Alles erledigt! 🎉
